package effect

// TITLE:食事ラッパ(正露丸のテーマ曲)

func Bugle_call_Syokuji() *Song {
	return &Song{
		Title:       "食事ラッパ(正露丸のテーマ曲)",	// 楽曲名
		BPM:         120.0,							// 楽曲のテンポ
		Repetitions: 1,								// 繰返しの回数,0と定義すると、無限ループになり、永久に演奏を繰り返す。
		Notes: []Note{
			{ R   , L2  },		// 何故か、最初にノイズが再生されるので、ここに、ダミーの休符を置く。
			{ C6  , L16 },
			{ R   , L16 },     // ドッ
			{ C6  , L16 },     // ド
			{ C6  , L16 },     // ド
			{ C6  , L16 },
			{ R   , L16 },     // ドッ
			{ C6  , L16 },
			{ R   , L16 },     // ドッ
			{ E6  , L16 },
			{ R   , L16 },     // ミッ
			{ E6  , L16 },     // ミ
			{ E6  , L16 },     // ミ
			{ E6  , L16 },
			{ R   , L16 },     // ミッ
			{ E6  , L16 },
			{ R   , L16 },     // ミッ
		 
			{ C6  , L8d },     // ドー．
			{ E6  , L16 },     // ミ
			{ C6  , L16 },
			{ R   , L16 },     // ドッ
			{ E6  , L16 },
			{ R   , L16 },     // ミッ
			{ G6  , L16 },
			{ R   , L16 },     // ソッ
			{ G6  , L16 },
			{ R   , L16 },     // ソッ
			{ G6  , L8d },     // ソー.
		 
			{ C6  , L16 },
			{ R   , L16 },     // ドッ
			{ C6  , L16 },     // ド
			{ C6  , L16 },     // ド
			{ C6  , L16 },
			{ R   , L16 },     // ドッ
			{ C6  , L16 },
			{ R   , L16 },     // ドッ
			{ E6  , L16 },
			{ R   , L16 },     // ミッ
			{ E6  , L16 },     // ミ
			{ E6  , L16 },     // ミ
			{ E6  , L16 },
			{ R   , L16 },     // ミッ
			{ E6  , L16 },
			{ R   , L16 },     // ミッ
		 
			{ C6  , L8d },     // ドー．
			{ E6  , L16 },     // ミ
			{ C6  , L16 },
			{ R   , L16 },     // ドッ
			{ E6  , L16 },
			{ R   , L16 },     // ミッ
			{ C6  , L4  },     // ドーー
		},
	}
}

