package effect

// TITLE:突撃ラッパ

func Bugle_call_Totsugeki() *Song {
	return &Song{
		Title:       "突撃ラッパ",				// 楽曲名
		BPM:         180.0,						// 楽曲のテンポ
		Repetitions: 1,							// 繰返しの回数,0と定義すると、無限ループになり、永久に演奏を繰り返す。
		Notes: []Note{
			{ R   , L2  },		// 何故か、最初にノイズが再生されるので、ここに、ダミーの休符を置く。
			{ C6  , L16 }, // ドッ
			{ R   , L16 },
			{ C6  , L16 }, // ド
			{ G6  , L16 }, // ソッ
			{ R   , L16 },
			{ G6  , L16 }, // ソ
			{ C6  , L16 }, // ドッ
			{ R   , L16 },
			{ C6  , L16 }, // ド
			{ C6  , L8d }, // ドー

			{ E6  , L16 }, // ミッ
			{ R   , L16 },
			{ C6  , L16 }, // ド
			{ E6  , L16 }, // ミッ
			{ R   , L16 },
			{ C6  , L16 }, // ド
			{ G6  , L16 }, // ソッ
			{ R   , L16 },
			{ G6  , L16 }, // ソ
			{ C6  , L4d }, // ドー
		},
	}
}

