package effect

// TITLE:京都&阪神G1ファンファーレ

func Fanfare() *Song {
	return &Song{
		Title:       "京都&阪神G1ファンファーレ",	// 楽曲名
		BPM:         150.0,							// 楽曲のテンポ
		Repetitions: 3,								// 繰返しの回数,0と定義すると、無限ループになり、永久に演奏を繰り返す。
		Notes: []Note{
			{ R   , L2  },		// 何故か、最初にノイズが再生されるので、ここに、ダミーの休符を置く。
			{ D4 ,  L8  },
			{ G4 ,  L8  },
			{ B4 ,  L8  },
			{ D4 ,  L8  },
			{ R  ,  L8  },
			{ B4 ,  L8  },
			{ D4 ,  L8  },
			{ R  ,  L8  },
		    // ---M001:212:212---
			{ B4 ,  L8  },
			{ G4 ,  L8  },
			{ R  ,  L8  },
			{ D4 ,  L8  },
			{ G4 ,  L8  },
			{ R  ,  L8  },
			{ G4 ,  L8  },
			{ G4 ,  L8  },
		    // ---M002:192:404---
			{ B4 ,  L8  },
			{ G4 ,  L8  },
			{ D4 ,  L4  },
			{ G4 ,  L8  },
			{ R  ,  L8  },
			{ D4 ,  L8  },
			{ G4 ,  L8  },
		    // ---M003:192:596---
			{ B4 ,  L8  },
			{ D4 ,  L8  },
			{ R  ,  L8  },
			{ B4 ,  L8  },
			{ D4 ,  L8  },
			{ R  ,  L8  },
			{ B4 ,  L8  },
			{ G4 ,  L8  },
		    // ---M004:192:788---
			{ G4 ,  L8  },
			{ G4 ,  L8  },
			{ G4 ,  L8  },
			{ G4 ,  L8  },
			{ B4 ,  L8  },
			{ D4 ,  L8  },
			{ G4 ,  L4  },
		    // ---M005:192:980---
			{ G4 ,  L8  },
			{ R  ,  L8  },
			{ F5 ,  L4  },
			{ E5 ,  L8d },
			{ D4 ,  L16 },
			{ CS5,  L4  },
		    // ---M006:192:1172---
			{ D4 ,  L8  },
			{ R  ,  L8  },
			{ F5 ,  L4  },
			{ E5 ,  L8d },
			{ D4 ,  L16 },
			{ CS5,  L8  },
			{ D4 ,  L8  },
		    // ---M007:192:1364---
			{ C5 ,  L8  },
			{ D4 ,  L8  },
			{ G5 ,  L4d },
			{ G5 ,  L16 },
			{ G5 ,  L16 },
			{ G5 ,  L8  },
			{ G5 ,  L8  },
		    // ---M008:192:1556---
			{ G5 ,  L8  },
			{ G5 ,  L8  },
			{ G5 ,  L8  },
			{ R  ,  L4  },
			{ A5 ,  L8  },
			{ A5 ,  L8  },
			{ G5 ,  L8  },
		    // ---M009:192:1748---
			{ G5 ,  L2  },
		},
	}
}

