package music

// 楽譜データ
// TITLE:ドリフターズ "盆回し"の音楽

func BonMawashi() *Song {
	return &Song{
		Title:       "盆回し",	// 楽曲名
		BPM:         152.0,							// 楽曲のテンポ
		Repetitions: 3,								// 繰返しの回数,0と定義すると、無限ループになり、永久に演奏を繰り返す。
		Notes: []Note{
			{ R   , L2  }, // 何故か、最初にノイズが再生されるので、ここに、ダミーの休符を置く。
		    { B4,  L8 },
		    { B4,  L8 },
		    { A4,  L8 },
		    { B4,  L8 },
		    { B4,  L16 },
		    { B4,  L16 },
		    { F4,  L8 },
		    { A4,  L8 },

		    { B4,  L8 },
		    { B4,  L16 },
		    { B4,  L16 },
		    { F4,  L8 },
		    { G4,  L8 },
		    { B4,  L8 },
		    { B4,  L16 },
		    { B4,  L16 },
		    { B4,  L4d },

		    { B4,  L8 },
		    { B4,  L8 },
		    { A4,  L8 },
		    { B4,  L8 },
		    { B4,  L16 },
		    { B4,  L16 },
		    { F4,  L8 },
		    { A4,  L8 },

		    { B4,  L8 },
		    { B4,  L16 },
		    { B4,  L16 },
		    { F4,  L8 },
		    { A4,  L8 },
		    { B4,  L8 },
		    { B4,  L16 },
		    { B4,  L16 },
		    { B4,  L4d},

		    { F5,  L8 },
		    { F5,  L16 },
		    { F5,  L8 },
		    { F5,  L16 },
		    { F5,  L8 },
		    { F5,  L2 },

		    { B4,  L8 },
		    { A4,  L4 },
		    { B4,  L8 },
		    { A4,  L4 },
		    { B4,  L4 },

		    { F5,  L8 },
		    { F5,  L16 },
		    { F5,  L8 },
		    { F5,  L16 },
		    { F5,  L8 },
		    { F5,  L2 },

		    { B4,  L8 },
		    { A4,  L4 },
		    { B4,  L8 },
		    { A4,  L4 },
		    { B4,  L8 },
		},
	}
}
