package music

// 楽譜データ
// TITLE:この木なんの木
// 日立グループCMソング 日立の樹

func KonoKiNannoKi() *Song {
	return &Song{
		Title:       "この木なんの木",	// 楽曲名
		BPM:         120.0,							// 楽曲のテンポ
		Repetitions: 1,								// 繰返しの回数,0と定義すると、無限ループになり、永久に演奏を繰り返す。
		Notes: []Note{
			{R  , L1  },	// 何故か、最初にノイズが再生されるので、ここに、ダミーの休符を置く。
			{G4 , L8  },
			{C5 , L4  },
			{D5 , L8  },
			{E5 , L4  },
			{D5 , L8  },
			{C5 , L8  },
			// ---M001:192:192---
			{F4 , L8  },
			{F4 , L8  },
			{F4 , L8  },
			{G4 , L8  },
			{A4 , L4  },
			{R  , L4  },
			// ---M002:192:384---
			{G4 , L8  },
			{G4 , L8  },
			{B4 , L8  },
			{D5 , L8  },
			{F5 , L8  },
			{F5 , L8  },
			{F5 , L8  },
			{A5 , L8  },
			// ---M003:192:576---
			{G5 , L8  },
			{F5 , L8  },
			{E5 , L8  },
			{E5 , L8  },
			{E5 , L4  },
			{R  , L4  },
			// ---M004:192:768---
			{G4 , L8  },
			{G4 , L8  },
			{C5 , L8  },
			{D5 , L8  },
			{E5 , L8  },
			{E5 , L4  },
			{E5 , L8  },
			// ---M005:192:960---
			{F5 , L2d },
			{R  , L8  },
			{A4 , L8  },
			// ---M006:192:1152---
			{G4 , L4d },
			{F5 , L8  },
			{E5 , L8  },
			{E5 , L8  },
			{D5 , L8  },
			{B4 , L8  },
			// ---M007:192:1344---
			{C5 , L1  },
			// ---M008:192:1536---
		},
	}
}

