package music

// 楽譜データ
// TITLE:水戸黄門 ああ，人生になみだあり。
// 人生楽ありゃ苦もあるさ	涙のあとには虹も出る	歩いてゆくんだしっかりと	自分の道をふみしめて
// 人生勇気が必要だ	くじけりゃ誰かが先に行く	あとから来たのに追い越され	泣くのがいやならさあ歩け
// 人生涙と笑顔あり	そんなに悪くはないもんだ	なんにもしないで生きるより	何かを求めて生きようよ

func MitoKoumon() *Song {
	return &Song{
		Title:       "MitoKoumon",	// 楽曲名
		BPM:         120.0,							// 楽曲のテンポ
		Repetitions: 1,								// 繰返しの回数,0と定義すると、無限ループになり、永久に演奏を繰り返す。
		Notes: []Note{
			{ R  , L2  }, // 何故か、最初にノイズが再生されるので、ここに、ダミーの休符を置く。
			{ E5 , L4d },
			{ D5 , L8  },
			{ C5 , L4  },
			{ D5 , L4  },	// 5
			// ---M001:192:192---
			{ E5 , L4  },
			{ E5 , L4  },
			{ D5 , L4  },
			{ C5 , L4  },	// 9
			// ---M002:192:384---
			{ D5 , L4d },
			{ C5 , L8  },
			{ B4 , L4  },
			{ G4 , L4  },	// 13
			// ---M003:192:576---
			{ A4 , L2  },
			{ R  , L2  },	// 15
			// ---M004:192:768---
			{ E4 , L4  },
			{ E4 , L4  },
			{ G4 , L4  },
			{ E4 , L4  },	// 19
			// ---M005:192:960---
			{ G4 , L4  },
			{ G4 , L4  },
			{ C5 , L4  },
			{ B4 , L4  },	// 24
			// ---M006:192:1152---
			{ A4 , L4d },
			{ B4 , L8  },
			{ A4 , L4  },
			{ A4 , L4  },	// 27
			// ---M007:192:1344---
			{ A4 , L2  },
			{ R  , L2  },	// 29
			// ---M008:192:1536---
			{ E5 , L2d },
			{ E5 , L4  },	// 31
			// ---M009:192:1728---
			{ E5 , L2  },
			{ D5 , L4  },
			{ R  , L4  },	// 34
			// ---M010:192:1920---
			{ E5 , L2  },
			{ A5 , L4  },
			{ G5 , L4  },	// 37
			// ---M011:192:2112---
			{ E5 , L2  },
			{ D5 , L4  },
			{ R  , L4  },	// 40
			// ---M012:192:2304---
			{ C5 , L2  },
			{ R  , L4  },
			{ C5 , L4  },	// 44
			// ---M013:192:2496---
			{ C5 , L2  },
			{ A4 , L2  },	// 46
			// ---M014:192:2688---
			{ B4 , L1  },
			{ R  , L2  },
			// ---M016:384:3072---
			{ A4 , L4  },
			// ---M016:048:3120---
			{ A4 , L4  },
			{ A4 , L4  },
			{ G4 , L4  },
			{ A4 , L2  },
			// ---M018:240:3360---
			{ C5 , L4  },
			{ B4 , L4  },
			{ R  , L4  },
			// ---M018:144:3504---
			{ A4 , L2  },
			{ G4 , L4  },
			{ E4 , L2  },
			// ---M020:240:3744---
			{ G4 , L2  },
			{ A4 , L1d },
			// ---M021:288:4032---
		},
	}
}

