package music

// 楽譜データ
// TITLE:得賞歌　表彰状授与の時に流される曲
// 「勝利をたたえる歌」（オラトリオ「マカベウスのユダ」から）
// 薮田義雄作詩　ヘンデル作曲

func SeeTheConqueringHeroComes() *Song {
	return &Song{
		Title:       "See the conquering hero comes",	// 楽曲名
		BPM:         100.0,							// 楽曲のテンポ
		Repetitions: 1,								// 繰返しの回数,0と定義すると、無限ループになり、永久に演奏を繰り返す。
		Notes: []Note{
			{ R   , L2  }, // 何故か、最初にノイズが再生されるので、ここに、ダミーの休符を置く。
			{ AS4 , L2  },
			{ G4  , L4d },
			{ GS4 , L8  },
		    // ---M001:192:192---
			{ AS4 , L2  },
			{ DS4 , L2  },
		    // ---M002:192:384---
			{ F4  , L8  },
			{ G4  , L8  },
			{ GS4 , L8  },
			{ AS4 , L8  },
			{ GS4 , L4  },
			{ G4  , L4  },
		    // ---M003:192:576---
			{ F4  , L1  },
		    // ---M004:192:768---
			{ G4  , L8  },
			{ GS4 , L8  },
			{ AS4 , L8  },
			{ C5  , L8  },
			{ AS4 , L4  },
			{ AS4 , L4  },
		    // ---M005:192:960---
			{ DS5 , L2  },
			{ AS4 , L2  },
		    // ---M006:192:1152---
			{ GS4 , L4  },
			{ G4  , L4  },
			{ F4  , L4d },
			{ DS4 , L8  },
		    // ---M007:192:1344---
			{ DS4 , L1  },
		    // ---M008:192:1536---
			{ G4  , L8  },
			{ F4  , L8  },
			{ G4  , L8  },
			{ GS4 , L8  },
			{ G4  , L4  },
			{ G4  , L4  },
		    // ---M009:192:1728---
			{ F4  , L2  },
			{ DS4 , L2  },
		    // ---M010:192:1920---
			{ GS4 , L4  },
			{ G4  , L4  },
			{ F4  , L4  },
			{ DS4 , L4  },
		    // ---M011:192:2112---
			{ D4  , L1  },
		    // ---M012:192:2304---
			{ DS4 , L8  },
			{ D4  , L8  },
			{ DS4 , L8  },
			{ F4  , L8  },
			{ DS4 , L4  },
			{ DS4 , L4  },
		    // ---M013:192:2496---
			{ C5  , L2  },
			{ A4  , L2  },
		    // ---M014:192:2688---
			{ AS4 , L4  },
			{ C5  , L8  },
			{ AS4 , L8  },
			{ A4  , L4d },
			{ AS4 , L8  },
		    // ---M015:192:2880---
			{ AS4 , L1  },
		    // ---M016:192:3072---
			{ AS4 , L2  },
			{ G4  , L4d },
			{ GS4 , L8  },
		    // ---M017:192:3264---
			{ AS4 , L2  },
			{ DS4 , L2  },
		    // ---M018:192:3456---
			{ F4  , L8  },
			{ G4  , L8  },
			{ GS4 , L8  },
			{ AS4 , L8  },
			{ GS4 , L4  },
			{ G4  , L4  },
		    // ---M019:192:3648---
			{ F4  , L1  },
		    // ---M020:192:3840---
			{ G4  , L8  },
			{ GS4 , L8  },
			{ AS4 , L8  },
			{ C5  , L8  },
			{ AS4 , L4  },
			{ AS4 , L4  },
		    // ---M021:192:4032---
			{ DS5 , L2  },
			{ AS4 , L2  },
		    // ---M022:192:4224---
			{ GS4 , L4  },
			{ G4  , L4  },
			{ F4  , L4d },
			{ DS4 , L8  },
		    // ---M023:192:4416---
			{ DS4 , L1  },
		    // ---M024:192:4608---
		},
	}
}

